{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 64, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 2]}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "conv2d_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Permute", "config": {"name": "permute", "trainable": true, "dtype": "float32", "dims": [2, 1, 3]}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "permute", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "beliefppg.model.positional_encoding", "class_name": "PositionalEncoding", "config": {"name": "positional_encoding_1", "trainable": true, "dtype": "float32", "seqlen": 7, "d_model": 32, "num_dims": 3}, "registered_name": "PositionalEncoding>PositionalEncoding", "build_config": {"input_shape": [null, 64, 7, 32]}, "name": "positional_encoding_1", "inbound_nodes": [[["permute", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 7, 32]}, "name": "dense_2", "inbound_nodes": [[["positional_encoding_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 7, 32]}, "name": "dense_3", "inbound_nodes": [[["positional_encoding_1", 0, 0, {}]]]}, {"module": "beliefppg.model.belief_ppg", "class_name": "FlexibleAttention", "config": {"name": "flexible_attention_1", "trainable": true, "dtype": "float32"}, "registered_name": "FlexibleAttention>FlexibleAttention", "build_config": {"input_shape": [[null, 64, 7, 32], [null, 64, 7, 32]]}, "name": "flexible_attention_1", "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"module": "beliefppg.model.positional_encoding", "class_name": "PositionalEncoding", "config": {"name": "positional_encoding", "trainable": true, "dtype": "float32", "seqlen": 64, "d_model": 32, "num_dims": 3}, "registered_name": "PositionalEncoding>PositionalEncoding", "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "positional_encoding", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 2]}, "name": "dense_4", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dtype": "float32", "dims": [2, 1, 3]}, "registered_name": null, "build_config": {"input_shape": [null, 64, 7, 32]}, "name": "permute_1", "inbound_nodes": [[["flexible_attention_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "dense", "inbound_nodes": [[["positional_encoding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "dense_1", "inbound_nodes": [[["positional_encoding", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "tf.__operators__.add", "inbound_nodes": [["dense_4", 0, 0, {"y": ["permute_1", 0, 0], "name": null}]]}, {"module": "beliefppg.model.belief_ppg", "class_name": "FlexibleAttention", "config": {"name": "flexible_attention", "trainable": true, "dtype": "float32"}, "registered_name": "FlexibleAttention>FlexibleAttention", "build_config": {"input_shape": [[null, 7, 64, 32], [null, 7, 64, 32]]}, "name": "flexible_attention", "inbound_nodes": [[["dense", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "tf.__operators__.add_1", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"y": ["flexible_attention", 0, 0], "name": null}]]}, {"module": "beliefppg.model.belief_ppg", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d", "trainable": true, "dtype": "float32", "dim": 1}, "registered_name": "AveragePooling1D>AveragePooling1D", "build_config": {"input_shape": [null, 7, 64, 32]}, "name": "average_pooling1d", "inbound_nodes": [[["tf.__operators__.add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 32]}, "name": "conv1d", "inbound_nodes": [[["average_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "dropout_2", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "conv1d_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "max_pooling1d", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 12]}, "name": "conv1d_2", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "dropout_3", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "conv1d_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 24]}, "name": "conv1d_4", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "dropout_4", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "conv1d_5", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "max_pooling1d_2", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d", "trainable": true, "dtype": "float32", "size": 4}, "registered_name": null, "build_config": {"input_shape": [null, 1, 48]}, "name": "up_sampling1d", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "conv1d_6", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "conv1d_7", "inbound_nodes": [[["up_sampling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 4, 12], [null, 4, 12]]}, "name": "add", "inbound_nodes": [[["conv1d_6", 0, 0, {}], ["conv1d_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 4, 12]}, "name": "activation", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 12]}, "name": "conv1d_8", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 4, 1]}, "name": "activation_1", "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 4, 48], [null, 4, 1]]}, "name": "multiply", "inbound_nodes": [[["conv1d_5", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 4, 48], [null, 4, 48]]}, "name": "concatenate", "inbound_nodes": [[["up_sampling1d", 0, 0, {}], ["multiply", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 96]}, "name": "conv1d_9", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "dropout_5", "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "conv1d_10", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_1", "trainable": true, "dtype": "float32", "size": 4}, "registered_name": null, "build_config": {"input_shape": [null, 4, 48]}, "name": "up_sampling1d_1", "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "conv1d_11", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 48]}, "name": "conv1d_12", "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 16, 12], [null, 16, 12]]}, "name": "add_1", "inbound_nodes": [[["conv1d_11", 0, 0, {}], ["conv1d_12", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 16, 12]}, "name": "activation_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 12]}, "name": "conv1d_13", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 16, 1]}, "name": "activation_3", "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 16, 24], [null, 16, 1]]}, "name": "multiply_1", "inbound_nodes": [[["conv1d_3", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 16, 48], [null, 16, 24]]}, "name": "concatenate_1", "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}], ["multiply_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 72]}, "name": "conv1d_14", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "dropout_6", "inbound_nodes": [[["conv1d_14", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "conv1d_15", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_2", "trainable": true, "dtype": "float32", "size": 4}, "registered_name": null, "build_config": {"input_shape": [null, 16, 24]}, "name": "up_sampling1d_2", "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "conv1d_16", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 24]}, "name": "conv1d_17", "inbound_nodes": [[["up_sampling1d_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 64, 6], [null, 64, 6]]}, "name": "add_2", "inbound_nodes": [[["conv1d_16", 0, 0, {}], ["conv1d_17", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 6]}, "name": "activation_4", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 6]}, "name": "conv1d_18", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 1]}, "name": "activation_5", "inbound_nodes": [[["conv1d_18", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 64, 12], [null, 64, 1]]}, "name": "multiply_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["activation_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 64, 24], [null, 64, 12]]}, "name": "concatenate_2", "inbound_nodes": [[["up_sampling1d_2", 0, 0, {}], ["multiply_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 36]}, "name": "conv1d_19", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "dropout_7", "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "conv1d_20", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_21", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64, 12]}, "name": "conv1d_21", "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 64, 1]}, "name": "flatten", "inbound_nodes": [[["conv1d_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation": "softmax"}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "activation_6", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1280, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "registered_name": null, "name": "input_2", "inbound_nodes": []}, {"module": "beliefppg.model.prior_layer", "class_name": "PriorLayer", "config": {"name": "prior_layer", "trainable": false, "dtype": "float32", "dim": 64, "min_hz": 0.5, "max_hz": 3.5, "is_online": true, "return_probs": false, "transition_prior": [[0.9958797097206116, 0.49893438816070557, 0.004329042974859476, 2.3204610499760747e-07, 1.68123829203011e-13, 3.812995662314018e-21, 5.394729138070547e-30, 8.240966203771033e-40, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.5010655522346497, 0.9912735223770142, 0.49893417954444885, 0.007803123909980059, 1.6087310541479383e-06, 7.805000569460763e-12, 1.7406221009249227e-18, 3.1477100106737614e-26, 7.322549203905508e-35, 3.2229864679470793e-44, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.004397446755319834, 0.5010653734207153, 0.9842784404754639, 0.498932808637619, 0.01250977348536253, 7.564985025965143e-06, 1.7010293174024582e-10, 2.4390287246407977e-16, 3.5733893859904673e-23, 7.909518745722545e-31, 3.648052140219976e-39, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [2.386119888342364e-07, 0.007918423973023891, 0.5010639429092407, 0.9748064279556274, 0.4989268481731415, 0.018382782116532326, 2.6632063963916153e-05, 2.1006534289824685e-09, 1.3986368961322986e-14, 1.1665435757564115e-20, 1.701601283731905e-27, 5.734203788330163e-35, 5.633219826585765e-43, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [1.7486012637846216e-13, 1.6509764009242645e-06, 0.012683790177106857, 0.5010578632354736, 0.9629923105239868, 0.49890777468681335, 0.02528354525566101, 7.520872168242931e-05, 1.678827743489819e-08, 4.028117628947919e-13, 1.4492461791894702e-18, 1.0412021260135617e-24, 1.9032359679996959e-31, 1.0857791593706662e-38, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 8.097300607801117e-12, 7.750514669169206e-06, 0.018624890595674515, 0.5010383725166321, 0.949116051197052, 0.4988591969013214, 0.0330374538898468, 0.00017902291438076645, 9.558203117876474e-08, 6.7632704991993364e-12, 8.413398932320164e-17, 2.3562929402330774e-22, 1.8362468498556568e-28, 4.7697037858182646e-35, 4.817664120348721e-42, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 1.760461776356692e-10, 2.7245376259088516e-05, 0.025600379332900047, 0.5009887218475342, 0.9335294961929321, 0.49875539541244507, 0.041461072862148285, 0.00037246322608552873, 4.161296658367064e-07, 7.394957562967264e-11, 2.6605438280946766e-15, 2.4018441165505925e-20, 6.553415131507308e-26, 6.343090356196724e-32, 2.4996779593568456e-38, 4.203895392974451e-45, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 2.220446049250313e-16, 2.1694805951710805e-09, 7.684280717512593e-05, 0.03343304246664047, 0.5008828639984131, 0.9166015386581421, 0.49856194853782654, 0.05037941783666611, 0.0006959107704460621, 1.4610429843742168e-06, 5.724536955575843e-10, 5.1485999843928557e-14, 1.2816929912986118e-18, 1.040635881655794e-23, 3.1780633671543215e-29, 4.131245623400529e-35, 2.5448981410603003e-41, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 1.454392162258955e-14, 1.7306406974171296e-08, 0.0001827080559451133, 0.041937217116355896, 0.5006858110427856, 0.8986836075782776, 0.4982385039329529, 0.059635210782289505, 0.0011919119860976934, 4.308252755436115e-06, 3.3450973102588932e-09, 6.669275049754619e-13, 4.022395023004897e-17, 8.486610551884806e-22, 7.114541600077933e-27, 2.648878659673319e-32, 4.827541592964054e-38, 4.624284932271896e-44, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 4.1877612488860905e-13, 9.837162195935889e-08, 0.0003797540266532451, 0.05093613266944885, 0.5003566741943359, 0.8800906538963318, 0.49774250388145447, 0.06909254938364029, 0.0019012067932635546, 1.100978442991618e-05, 1.5508957673660007e-08, 6.2023025604318605e-12, 8.133293474643741e-16, 3.9792460407401054e-20, 8.141953704074109e-25, 7.70333684850922e-30, 3.681499074094148e-35, 9.606181232639486e-41, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 7.0172756494457644e-12, 4.276547258541541e-07, 0.0007089072023518384, 0.06027115508913994, 0.49985238909721375, 0.8610933423042297, 0.4970332086086273, 0.07863704860210419, 0.002859396394342184, 2.499092443031259e-05, 5.933287994253078e-08, 4.37669102348881e-11, 1.1390771172700796e-14, 1.1735860687070658e-18, 5.303799642259087e-23, 1.151464209942552e-27, 1.3014844230905957e-32, 8.223912961979586e-38, 3.0968696061578457e-43, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 1.1102230246251565e-16, 7.658462752857531e-11, 1.4995628134784056e-06, 0.0012132119154557586, 0.06980539113283157, 0.4991317689418793, 0.8419169187545776, 0.49607500433921814, 0.08817402273416519, 0.004094652831554413, 5.1378847274463624e-05, 1.932431814566371e-07, 2.4493818084891927e-10, 1.1709348226272842e-13, 2.3401788216433632e-17, 2.1446901027069436e-21, 9.788043747240825e-26, 2.393952361890293e-30, 3.3495358533992725e-35, 2.8416230908810803e-40, 1.401298464324817e-45, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2.7755575615628914e-15, 5.91862781007535e-10, 4.416684078023536e-06, 0.00193380459677428, 0.07942375540733337, 0.4981590211391449, 0.8227443099021912, 0.49483969807624817, 0.09762585163116455, 0.005626537837088108, 9.717917419038713e-05, 5.494259767147014e-07, 1.1266100274909263e-09, 9.25955384416255e-13, 3.3455456194072153e-16, 5.776922769319508e-20, 5.138641908761934e-24, 2.518040494643321e-28, 7.217661679691559e-33, 1.2769208941895035e-37, 1.462955596755109e-42, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 5.362377208939506e-14, 3.4533034209971447e-09, 1.1274982171016745e-05, 0.002906549023464322, 0.08903108537197113, 0.4969058036804199, 0.8037208318710327, 0.4933076798915863, 0.10692918300628662, 0.007465775590389967, 0.00017125373415183276, 1.391734826938773e-06, 4.384362650711182e-09, 5.852866368644127e-12, 3.5976237891803976e-15, 1.0983161484823436e-18, 1.7831461126536237e-22, 1.6371578574185603e-26, 8.982981127288939e-31, 3.095466065615978e-35, 7.004684646605106e-40, 1.1210387714598537e-44, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 6.932232565759477e-13, 1.5988758761409372e-08, 2.556838262535166e-05, 0.004159736912697554, 0.09854944050312042, 0.49535247683525085, 0.7849591374397278, 0.49146807193756104, 0.11603233963251114, 0.009614727459847927, 0.0002840964589267969, 3.1936440336721716e-06, 1.47844563258559e-08, 3.051879582383066e-11, 3.02759797484245e-14, 1.546161699644934e-17, 4.326620700540463e-21, 7.019137902351031e-25, 6.946570512568483e-29, 4.390934618563865e-33, 1.8477880282993905e-37, 5.3739796106856735e-42, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 6.4357408291471074e-12, 6.10923152066789e-08, 5.252012124401517e-05, 0.0057129147462546825, 0.10791526734828949, 0.4934883415699005, 0.7665448784828186, 0.48931828141212463, 0.12489316612482071, 0.012068308889865875, 0.00044744176557287574, 6.730883796990383e-06, 4.405869447055011e-08, 1.3475555393771543e-10, 2.0606954998728805e-13, 1.6772808778675726e-16, 7.693687656712405e-20, 2.0947554472201687e-23, 3.5483048257758664e-27, 3.902027401579995e-31, 2.89531863734555e-35, 1.501178814966497e-39, 5.605193857299268e-44, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.881784197001252e-16, 4.534528308397512e-11, 1.9874698864441598e-07, 9.925833728630096e-05, 0.007576672825962305, 0.11707674711942673, 0.4913110136985779, 0.7485412955284119, 0.4868628978729248, 0.1334773600101471, 0.014815129339694977, 0.0006737621733918786, 1.3178811968828086e-05, 1.1795517451673732e-07, 5.149820569982921e-10, 1.1660831805357375e-12, 1.4498074270253517e-15, 1.0430040284869946e-18, 4.5542194662792675e-22, 1.2606099570830415e-25, 2.3012014565595652e-29, 2.8717303113359483e-33, 2.5313156353052927e-37, 1.6236845306131655e-41, 1.401298464324817e-45, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.1879386363489175e-14, 2.534207288462653e-10, 5.644836846840917e-07, 0.0001747891801642254, 0.009753146208822727, 0.12599165737628937, 0.48882535099983215, 0.7309934496879578, 0.48411256074905396, 0.14175711572170258, 0.017838692292571068, 0.0009757181396707892, 2.4201965061365627e-05, 2.87634861706465e-07, 1.734902999039889e-09, 5.614654140922992e-12, 1.0271390874882873e-14, 1.1145360436006815e-17, 7.496721735696751e-21, 3.254295583702066e-24, 9.458266993974992e-28, 1.9032359679996959e-31, 2.7339045514953077e-35, 2.882796042359872e-39, 2.284116496849452e-43, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.219024881038422e-13, 1.1641437813736388e-09, 1.428500581823755e-06, 0.0002897650410886854, 0.01223695557564497, 0.134625643491745, 0.486042320728302, 0.7139317393302917, 0.4810825288295746, 0.1497102826833725, 0.02111854776740074, 0.0013656173832714558, 4.202324271318503e-05, 6.463234285547514e-07, 5.232811517430491e-09, 2.3460147019482847e-11, 6.108962890671171e-14, 9.657798857933098e-17, 9.655287025775383e-20, 6.336654594376234e-23, 2.825013206995089e-26, 8.827558580776889e-30, 1.989576718670524e-33, 3.320261468431948e-37, 4.202634224356559e-41, 4.203895392974451e-45, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 9.621192731401607e-13, 4.5251136171486905e-09, 3.2750961054262007e-06, 0.00045608371146954596, 0.01501636952161789, 0.14295092225074768, 0.48297756910324097, 0.6973749399185181, 0.4777916669845581, 0.15731953084468842, 0.02463134564459324, 0.0018549271626397967, 6.946262874407694e-05, 1.3515190175894531e-06, 1.4318599639295826e-08, 8.650141020138946e-11, 